app/controllers/animals_controller.rb

  def index
    @animals = current_user.animals.take(5)
---
SELECT  "animals".* FROM "animals" WHERE "animals"."user_id" = $1 LIMIT $2  [["user_id", 25], ["LIMIT", 5]]