app/controllers/pages_controller.rb

  def welcome
     @petshops = Petshop.take(10)
---
SELECT  "petshops".* FROM "petshops" LIMIT $1  [["LIMIT", 10]]