app/controllers/petshops_controller.rb

  def index
    @petshops = Petshop.all
---
SELECT "petshops".* FROM "petshops"

  def update
    respond_to do |format|
      if @petshop.update(petshop_params)
---
UPDATE "petshops" SET "address" = $1, "phone" = $2, "estado" = $3, "cidade" = $4, "updated_at" = $5 WHERE "petshops"."id" = $6  [["address", "Governador Roberto Silveira, 238"], ["phone", 0], ["estado", "RJ"], ["cidade", "Macaé"], ["updated_at", "2019-03-08 19:37:33.348782"], ["id", 2]]

    def set_petshop
      @petshop = Petshop.find(params[:id])
---
SELECT  "petshops".* FROM "petshops" WHERE "petshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]