app/models/user.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "petshops" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Titulo de sua loja"], ["created_at", "2019-03-09 11:56:44.514966"], ["updated_at", "2019-03-09 11:56:44.514966"], ["user_id", 15]]
---
  def welcome_send
    @user = User.last
    @user.create_petshop(title: 'Titulo de sua loja')